package com.izhonghong.spark.constant

import java.util.regex.Pattern

/**
 * 2021/3/8 16:56
 * @author sw
 * deploy
 */
object Constant {
  //媒体账号正则表达式
  val MEDIAREGULAREXPRESSION = ".*南方日报.*|.*南方周末.*|.*南方都市报.*|.*21世纪经济报道.*|.*南方农村报.*|.*南都周刊.*|.*风尚周报.*|.*理财周报.*|.*南方月刊.*|.*城市画报.*|.*南方人物周刊.*|.*21世纪商业评论.*|.*商旅周刊.*|.*南方第一消费.*|.*鞋包世界.*|.*南方网.*|.*南方报业网.*|.*奥一网.*|.*凯迪网.*|.*番茄网.*|.*羊城晚报.*|.*金羊网.*|.*新快报.*|.*广东建设报.*|.*民营经济报.*|.*可乐生活.*|.*羊城体育.*|.*广西日报.*|.*南国早报.*|.*当代生活报.*|.*南国今报.*|.*南国城报.*|.*南国健报.*|.*广西画报.*|.*法制与经济杂志.*|.*广西法治日报.*|.*广西新闻网.*|.*平安广西网.*|.*广西工人报.*|.*南方科技报.*|.*桂风网.*|.*江南都市报.*|.*大众日报.*|.*农村大众.*|.*齐鲁晚报.*|.*生活日报.*|.*鲁中晨报.*|.*半岛都市报.*|.*经济导报.*|.*城市信报.*|.*现代交通报.*|.*山东法制报.*|.*新晨报.*|.*青年记者.*|.*成长先锋.*|.*半岛新生活.*|.*山东人事.*|.*山东劳动保障.*|.*大众网.*|.*山东工人报.*|.*山东教育.*|.*现代教育导报.*|.*当代小学生.*|.*小学生文摘.*|.*齐鲁网.*|.*山东网络台.*|.*山东广播电视台.*|.*闪电新闻.*|.*山东手机台.*|.*轻快云平台.*|.*山东广播电视报.*|.*山东在线.*|.*中国山东网.*|.*大河客户端.*|.*河南手机报.*|.*大河网.*|.*新闻爱好者.*|.*今日消费.*|.*大河文摘报.*|.*河南日报农村版.*|.*河南政府网.*|.*河南法制报.*|.*河南商报.*|.*大河报.*|.*大豫网.*|.*河南日报.*|.*东方今报.*|.*映象网.*|.*新浪河南.*|.*网易河南.*|.*新华社河南分社.*|.*南方报业传媒集团.*|.*羊城晚报报业集团.*|.*广西日报传媒集团.*|.*江西日报社.*|.*大众报业集团.*|.*山东工人报社.*|.*山东教育社.*|.*山东广播电视台.*|.*河南报业集团.*|.*大象融媒.*|.*深圳报业集团.*|.*广州日报报业集团.*|.*东莞日报社.*|.*佛山传媒集团.*|.*江门日报社.*|.*河源日报社.*|.*潮州日报社.*|.*清远日报.*|.*揭阳报社.*|.*茂名日报社.*|.*梅州日报社.*|.*汕头经济特区报社.*|.*汕尾日报社.*|.*韶关日报社.*|.*云浮日报社.*|.*阳江日报社.*|.*湛江日报社.*|.*西江日报社.*|.*中山日报社.*|.*珠江时报社.*|.*珠海特区报社.*|.*惠州报业传媒集团.*|.*南宁日报社.*|.*柳州日报社.*|.*桂林日报社.*|.*梧州日报社.*|.*贺州日报社.*|.*玉林日报社.*|.*玉林广播电视报社.*|.*贵港日报社.*|.*北海日报社.*|.*沿海时报社.*|.*钦州日报社.*|.*钦州市广播电视台.*|.*防城港日报社.*|.*左江日报社.*|.*右江日报社.*|.*河池日报社.*|.*来宾日报社.*|.*济南日报报业集团.*|.*德州日报社.*|.*潍坊报业集团（潍坊日报社.*|.*开封报业.*|.*洛阳报业.*|.*焦作报业.*|.*信阳报刊.*|.*深圳特区报.*|.*深圳商报.*|.*深圳晚报.*|.*晶报.*|.*深圳新闻网.*|.*Shenzhen Daily.*|.*广州日报.*|.*信息时报.*|.*足球.*|.*广州英文早报.*|.*岭南少年报.*|.*时尚荟.*|.*老人报.*|.*舞台与银幕.*|.*篮球先锋报.*|.*美食导报.*|.*广州文摘报.*|.*赢周刊.*|.*第一财经日报.*|.*羊城地铁报.*|.*番禺日报.*|.*增城日报.*|.*新现代画报.*|.*南风窗.*|.*看世界.*|.*大东方.*|.*共鸣.*|.*大洋网.*|.*东莞日报.*|.*东莞时报.*|.*东莞时间网.*|.*佛山日报.*|.*佛山在线.*|.*佛山新闻网.*|.*江门日报.*|.*江门新闻网.*|.*河源日报.*|.*河源网.*|.*河源晚报.*|.*河源新闻网.*|.*潮州日报.*|.*潮州新闻网.*|.*揭阳日报.*|.*揭阳新闻网.*|.*茂名日报.*|.*茂名网.*|.*茂名晚报.*|.*梅州日报.*|.*梅州网.*|.*汕头日报.*|.*特区青年报.*|.*潮商.*|.*汕头特区晚报.*|.*大华网.*|.*汕头都市报.*|.*汕尾日报.*|.*汕尾日报网.*|.*韶关日报.*|.*韶关新闻网.*|.*云浮日报.*|.*云浮新闻网.*|.*阳江日报.*|.*阳江新闻网.*|.*湛江日报.*|.*湛江晚报.*|.*湛江新闻网.*|.*西江日报.*|.*西江网.*|.*中山日报.*|.*中山商报.*|.*中山网.*|.*珠江时报.*|.*南海新闻网.*|.*珠海特区报.*|.*珠江晚报.*|.*惠州日报.*|.*东江时报.*|.*惠州日报手机报.*|.*今日惠州网.*|.*惠州新闻网.*|.*南宁日报.*|.*南宁晚报.*|.*南宁新闻网.*|.*柳州日报.*|.*柳州晚报.*|.*柳州新闻网.*|.*桂林日报.*|.*桂林晚报.*|.*桂林生活网.*|.*梧州日报.*|.*西江都市报.*|.* 梧州零距离.*|.*贺州日报.*|.*贺州晚报.*|.*贺州传媒网.*|.*玉林日报.*|.*玉林晚报.*|.*玉林新闻网.*|.*玉林时代网.*|.*玉林广播网.*|.*玉林电视网.*|.*贵港日报.*|.*贵港晚报.*|.*贵港新闻晨报.*|.*贵港新闻网.*|.*北海日报.*|.*北海晚报.*|.*北海新闻网.*|.*沿海时报.*|.*钦州日报.*|.*钦州新闻网.*|.*钦州广播电视网.*|.*防城港日报.*|.*防城港市新闻网.*|.*左江日报.*|.*崇左新闻网.*|.*右江日报.*|.*百色早报.*|.*百色新闻网.*|.*河池日报.*|.*河池网.*|.* 河池文明网.*|.*来宾日报.*|.*来宾网.*|.*济南日报.*|.*济南时报.*|.*当代健康报.*|.*都市女报.*|.*人口导报.*|.*舜网.*|.*泉城济南.*|.*济南传媒网.*|.*德州日报.*|.*德州新闻网.*|.*德州晚报.*|.*夏津大众报.*|.*平原时讯报.*|.*潍坊日报.*|.*潍坊晚报.*|.*潍坊新闻网.*|.*潍坊手机报.*|.*文广传播的传媒骄子.*|.*开封网.*|.*开封日报.*|.*汴梁晚报.*|.*洛阳日报.*|.*洛阳晚报.*|.*洛阳网.*|.*洛阳商报.*|.*焦作日报.*|.*焦作晚报.*|.*焦作网.*|.*信阳新闻网.*|.*信阳晚报.*"

  def main(args: Array[String]): Unit = {
    println(mediaMatch("老子的垃情感圾桶，没允许谁来找共鸣", MEDIAREGULAREXPRESSION))
  }

  def mediaMatch(filed:String,regularExpression: String): Boolean ={
    val pattern = Pattern.compile(regularExpression)
    val matcher = pattern.matcher(filed)
    matcher.matches()
  }
}
